{
  "Apple___Apple_scab": "Apply fungicides like mancozeb and remove fallen leaves to reduce infection.",
  "Apple___Black_rot": "Prune infected branches and apply captan or chlorothalonil fungicides.",
  "Apple___Cedar_apple_rust": "Use resistant varieties and apply fungicides early in the season.",
  "Apple___healthy": "No disease detected. Maintain good pruning and fertilization practices.",
  
  "Corn___Cercospora_leaf_spot Gray_leaf_spot": "Rotate crops and use fungicides like strobilurins or triazoles.",
  "Corn___Common_rust": "Apply fungicides such as azoxystrobin at early disease stages.",
  "Corn___Northern_Leaf_Blight": "Use resistant varieties and apply fungicides if disease pressure is high.",
  "Corn___healthy": "No disease detected. Monitor regularly and maintain optimal growing conditions.",
  
  "Grape___Black_rot": "Prune infected canes and apply protective fungicides like mancozeb.",
  "Grape___Esca_(Black_Measles)": "Remove infected vines, avoid overwatering, and apply systemic fungicides.",
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Apply copper or mancozeb fungicides and remove infected leaves.",
  "Grape___healthy": "No disease detected. Ensure good air circulation and monitor for symptoms.",
  
  "Potato___Early_blight": "Use fungicides like chlorothalonil or maneb and remove infected foliage.",
  "Potato___Late_blight": "Destroy infected plants and apply systemic fungicides like metalaxyl.",
  "Potato___healthy": "No disease detected. Use certified seed and proper irrigation.",
  
  "Tomato___Bacterial_spot": "Use copper-based bactericides and avoid overhead irrigation.",
  "Tomato___Early_blight": "Apply fungicides like chlorothalonil and remove affected leaves.",
  "Tomato___Late_blight": "Apply metalaxyl fungicides and remove infected plants quickly.",
  "Tomato___Leaf_Mold": "Improve air circulation and use sulfur or copper fungicides.",
  "Tomato___Septoria_leaf_spot": "Remove infected leaves and apply mancozeb or chlorothalonil.",
  "Tomato___Spider_mites Two-spotted_spider_mite": "Use insecticidal soap or neem oil for treatment.",
  "Tomato___Target_Spot": "Apply appropriate fungicides and rotate crops.",
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "Control whiteflies and use virus-free transplants.",
  "Tomato___Tomato_mosaic_virus": "Remove infected plants and disinfect tools regularly.",
  "Tomato___healthy": "No disease detected. Maintain proper watering and pest control."
}
